# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [14]:
baby_names= pd.read_csv('C://Users/mkrijal/Desktop/US_Baby_Names_Right.csv')
baby_names.head()

   Unnamed: 0       Id     Name    Year Gender State  Count
0       11349  11350.0     Emma  2004.0      F    AK   62.0
1       11350  11351.0  Madison  2004.0      F    AK   48.0
2       11351  11352.0   Hannah  2004.0      F    AK   46.0
3       11352  11353.0    Grace  2004.0      F    AK   44.0
4       11353  11354.0    Emily  2004.0      F    AK   41.0

### Step 4. See the first 10 entries

In [15]:
baby_names.ix[:10, :]

    Unnamed: 0       Id      Name    Year Gender State  Count
0        11349  11350.0      Emma  2004.0      F    AK   62.0
1        11350  11351.0   Madison  2004.0      F    AK   48.0
2        11351  11352.0    Hannah  2004.0      F    AK   46.0
3        11352  11353.0     Grace  2004.0      F    AK   44.0
4        11353  11354.0     Emily  2004.0      F    AK   41.0
5        11354  11355.0   Abigail  2004.0      F    AK   37.0
6        11355  11356.0    Olivia  2004.0      F    AK   33.0
7        11356  11357.0  Isabella  2004.0      F    AK   30.0
8        11357  11358.0    Alyssa  2004.0      F    AK   29.0
9        11358  11359.0    Sophia  2004.0      F    AK   28.0
10       11359  11360.0    Alexis  2004.0      F    AK   27.0

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [17]:
#baby_names = baby_names.loc[:, "Unnamed: 0":"Id"]
#baby_names.head()

del baby_names['Unnamed: 0']
del baby_names['Id']

baby_names.head()

      Name    Year Gender State  Count
0     Emma  2004.0      F    AK   62.0
1  Madison  2004.0      F    AK   48.0
2   Hannah  2004.0      F    AK   46.0
3    Grace  2004.0      F    AK   44.0
4    Emily  2004.0      F    AK   41.0

### Step 6. Is there more male or female names in the dataset?

In [18]:
baby_names['Gender'].value_counts('F')

F    0.606439
M    0.393561
Name: Gender, dtype: float64

### Step 7. Group the dataset by name and assign to names

In [23]:
names = baby_names.groupby("Name").sum()
#print(names)

#print(names.shape) 

len(baby_names)

204020

### Step 8. How many different names exist in the dataset?

In [22]:
len(names)

13100

### Step 9. What is the name with most occurrences?

In [ ]:
names.Count.

### Step 10. How many different names have the least occurrences?

### Step 11. What is the median name occurrence?

### Step 12. What is the standard deviation of names?

In [ ]:
names

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [24]:
names.describe()

                Year         Count
count   13100.000000  13100.000000
mean    31286.763893    650.262290
std     48080.371478   2956.106193
min      2004.000000      5.000000
25%      4014.000000     10.000000
50%     12048.000000     40.000000
75%     34140.000000    186.000000
max    405793.000000  61285.000000